{"format": "layers-model", "generatedBy": "keras v3.10.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.10.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_9", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 30, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "lstm_input"}, "name": "lstm_input", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "lstm_8", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "seed": null}, "name": "lstm_8", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 4], "dtype": "float32", "keras_history": ["lstm_input", 0, 0]}}], "kwargs": {"training": false, "mask": null}}]}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.2, "seed": null, "noise_shape": null}, "name": "dropout_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 64], "dtype": "float32", "keras_history": ["lstm_8", 0, 0]}}], "kwargs": {"training": false}}]}, {"class_name": "LSTM", "config": {"name": "lstm_9", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 32, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "seed": null}, "name": "lstm_9", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 30, 64], "dtype": "float32", "keras_history": ["dropout_4", 0, 0]}}], "kwargs": {"training": false, "mask": null}}]}, {"class_name": "Dense", "config": {"name": "embedding_layer", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "embedding_layer", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32], "dtype": "float32", "keras_history": ["lstm_9", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 16], "dtype": "float32", "keras_history": ["embedding_layer", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["lstm_input", 0, 0]], "output_layers": [["output", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "embedding_layer/kernel", "shape": [32, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.41523054066826315, "scale": 0.0031940810820635626, "original_dtype": "float32"}}, {"name": "embedding_layer/bias", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0551292370931775, "scale": 0.00044459062171917335, "original_dtype": "float32"}}, {"name": "lstm_8/lstm_cell/kernel", "shape": [4, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.17770125001084572, "scale": 0.0017770125001084572, "original_dtype": "float32"}}, {"name": "lstm_8/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2923861759550431, "scale": 0.0021342056639054243, "original_dtype": "float32"}}, {"name": "lstm_8/lstm_cell/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.029084315194803124, "scale": 0.004154902170686161, "original_dtype": "float32"}}, {"name": "lstm_9/lstm_cell/kernel", "shape": [64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.34473784647735894, "scale": 0.002825720053093106, "original_dtype": "float32"}}, {"name": "lstm_9/lstm_cell/recurrent_kernel", "shape": [32, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3889964466001473, "scale": 0.0029029585567175173, "original_dtype": "float32"}}, {"name": "lstm_9/lstm_cell/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05996521395795486, "scale": 0.004283229568425347, "original_dtype": "float32"}}, {"name": "output/kernel", "shape": [16, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5098292348431606, "scale": 0.004078633878745285, "original_dtype": "float32"}}, {"name": "output/bias", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0670323446393013, "scale": 1.0, "original_dtype": "float32"}}]}]}